/* automatically generated by rust-bindgen 0.59.2 */

pub const __llvm__: u32 = 1;
pub const __clang__: u32 = 1;
pub const __clang_major__: u32 = 12;
pub const __clang_minor__: u32 = 0;
pub const __clang_patchlevel__: u32 = 1;
pub const __clang_version__: &[u8; 56usize] =
    b"12.0.1 (Red Hat 12.0.1-4.module+el8.5.0+13246+cefb5d4c)\0";
pub const __GNUC__: u32 = 4;
pub const __GNUC_MINOR__: u32 = 2;
pub const __GNUC_PATCHLEVEL__: u32 = 1;
pub const __GXX_ABI_VERSION: u32 = 1002;
pub const __ATOMIC_RELAXED: u32 = 0;
pub const __ATOMIC_CONSUME: u32 = 1;
pub const __ATOMIC_ACQUIRE: u32 = 2;
pub const __ATOMIC_RELEASE: u32 = 3;
pub const __ATOMIC_ACQ_REL: u32 = 4;
pub const __ATOMIC_SEQ_CST: u32 = 5;
pub const __OPENCL_MEMORY_SCOPE_WORK_ITEM: u32 = 0;
pub const __OPENCL_MEMORY_SCOPE_WORK_GROUP: u32 = 1;
pub const __OPENCL_MEMORY_SCOPE_DEVICE: u32 = 2;
pub const __OPENCL_MEMORY_SCOPE_ALL_SVM_DEVICES: u32 = 3;
pub const __OPENCL_MEMORY_SCOPE_SUB_GROUP: u32 = 4;
pub const __PRAGMA_REDEFINE_EXTNAME: u32 = 1;
pub const __VERSION__: &[u8; 62usize] =
    b"Clang 12.0.1 (Red Hat 12.0.1-4.module+el8.5.0+13246+cefb5d4c)\0";
pub const __OBJC_BOOL_IS_BOOL: u32 = 0;
pub const __CONSTANT_CFSTRINGS__: u32 = 1;
pub const __ORDER_LITTLE_ENDIAN__: u32 = 1234;
pub const __ORDER_BIG_ENDIAN__: u32 = 4321;
pub const __ORDER_PDP_ENDIAN__: u32 = 3412;
pub const __BYTE_ORDER__: u32 = 1234;
pub const __LITTLE_ENDIAN__: u32 = 1;
pub const _LP64: u32 = 1;
pub const __LP64__: u32 = 1;

pub const INT_FAST16_MIN: i64 = -9223372036854775808;
pub const INT_FAST32_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u64 = 9223372036854775807;
pub const INT_FAST32_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: i32 = -1;
pub const UINT_FAST32_MAX: i32 = -1;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const UINTPTR_MAX: i32 = -1;
pub const PTRDIFF_MIN: i64 = -9223372036854775808;
pub const PTRDIFF_MAX: u64 = 9223372036854775807;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub const SIZE_MAX: i32 = -1;
pub const WCHAR_MIN: i32 = -2147483648;
pub const WCHAR_MAX: u32 = 2147483647;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 4294967295;
pub const NULL: u32 = 0;
pub const FALSE: u32 = 0;
pub const TRUE: u32 = 1;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const KBD_DATA_REG: u32 = 96;
pub const KBD_ACK_REG: u32 = 97;
pub const KBD_CMD_REG: u32 = 100;
pub const KBD_STATUS_REG: u32 = 100;
pub const KEY_SPECIAL_FLAG: u32 = 256;
pub const KEY_KEYPAD_FLAG: u32 = 512;
pub const KEY_SHIFT_FLAG: u32 = 4096;
pub const KEY_ALT_FLAG: u32 = 8192;
pub const KEY_CTRL_FLAG: u32 = 16384;
pub const KEY_CAPS_FLAG: u32 = 32768;
pub const ASCII_ESC: u32 = 27;
pub const ASCII_BS: u32 = 8;
pub const KEYPAD_START: u32 = 128;
pub type __u_char = core::ffi::c_uchar;
pub type __u_short = core::ffi::c_ushort;
pub type __u_int = core::ffi::c_uint;
pub type __u_long = core::ffi::c_ulong;
pub type __int8_t = core::ffi::c_schar;
pub type __uint8_t = core::ffi::c_uchar;
pub type __int16_t = core::ffi::c_short;
pub type __uint16_t = core::ffi::c_ushort;
pub type __int32_t = core::ffi::c_int;
pub type __uint32_t = core::ffi::c_uint;
pub type __int64_t = core::ffi::c_long;
pub type __uint64_t = core::ffi::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = core::ffi::c_long;
pub type __u_quad_t = core::ffi::c_ulong;
pub type __intmax_t = core::ffi::c_long;
pub type __uintmax_t = core::ffi::c_ulong;
pub type __dev_t = core::ffi::c_ulong;
pub type __uid_t = core::ffi::c_uint;
pub type __gid_t = core::ffi::c_uint;
pub type __ino_t = core::ffi::c_ulong;
pub type __ino64_t = core::ffi::c_ulong;
pub type __mode_t = core::ffi::c_uint;
pub type __nlink_t = core::ffi::c_ulong;
pub type __off_t = core::ffi::c_long;
pub type __off64_t = core::ffi::c_long;
pub type __pid_t = core::ffi::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [core::ffi::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::core::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = core::ffi::c_long;
pub type __rlim_t = core::ffi::c_ulong;
pub type __rlim64_t = core::ffi::c_ulong;
pub type __id_t = core::ffi::c_uint;
pub type __time_t = core::ffi::c_long;
pub type __useconds_t = core::ffi::c_uint;
pub type __suseconds_t = core::ffi::c_long;
pub type __daddr_t = core::ffi::c_int;
pub type __key_t = core::ffi::c_int;
pub type __clockid_t = core::ffi::c_int;
pub type __timer_t = *mut core::ffi::c_void;
pub type __blksize_t = core::ffi::c_long;
pub type __blkcnt_t = core::ffi::c_long;
pub type __blkcnt64_t = core::ffi::c_long;
pub type __fsblkcnt_t = core::ffi::c_ulong;
pub type __fsblkcnt64_t = core::ffi::c_ulong;
pub type __fsfilcnt_t = core::ffi::c_ulong;
pub type __fsfilcnt64_t = core::ffi::c_ulong;
pub type __fsword_t = core::ffi::c_long;
pub type __ssize_t = core::ffi::c_long;
pub type __syscall_slong_t = core::ffi::c_long;
pub type __syscall_ulong_t = core::ffi::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut core::ffi::c_char;
pub type __intptr_t = core::ffi::c_long;
pub type __socklen_t = core::ffi::c_uint;
pub type __sig_atomic_t = core::ffi::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = core::ffi::c_schar;
pub type int_fast16_t = core::ffi::c_long;
pub type int_fast32_t = core::ffi::c_long;
pub type int_fast64_t = core::ffi::c_long;
pub type uint_fast8_t = core::ffi::c_uchar;
pub type uint_fast16_t = core::ffi::c_ulong;
pub type uint_fast32_t = core::ffi::c_ulong;
pub type uint_fast64_t = core::ffi::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type schar_t = core::ffi::c_schar;
pub type uchar_t = core::ffi::c_uchar;
pub type sshort_t = core::ffi::c_short;
pub type ushort_t = core::ffi::c_ushort;
pub type sint_t = core::ffi::c_int;
pub type uint_t = core::ffi::c_uint;
pub type sllong_t = core::ffi::c_longlong;
pub type ullong_t = core::ffi::c_ulonglong;
pub type slong_t = core::ffi::c_long;
pub type ulong_t = core::ffi::c_ulong;
pub type size_t = core::ffi::c_ulong;
pub type ssize_t = core::ffi::c_long;
pub type off_t = core::ffi::c_ulong;
pub type sint64_t = core::ffi::c_long;
pub type sint32_t = core::ffi::c_int;
pub type sint16_t = core::ffi::c_short;
pub type sint8_t = core::ffi::c_char;
pub type addr_t = ulong_t;
pub type bool_t = uchar_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct naut_info {
    _unused: [u8; 0],
}
pub type nk_keycode_t = u16;
pub type nk_scancode_t = u16;
extern "C" {
    pub fn kbd_translate(arg1: nk_scancode_t) -> nk_keycode_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nk_mouse_event {
    pub left: u8,
    pub middle: u8,
    pub right: u8,
    pub res: u8,
    pub dx: sint32_t,
    pub dy: sint32_t,
}
#[test]
fn bindgen_test_layout_nk_mouse_event() {
    assert_eq!(
        ::core::mem::size_of::<nk_mouse_event>(),
        12usize,
        concat!("Size of: ", stringify!(nk_mouse_event))
    );
    assert_eq!(
        ::core::mem::align_of::<nk_mouse_event>(),
        4usize,
        concat!("Alignment of ", stringify!(nk_mouse_event))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<nk_mouse_event>())).left as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nk_mouse_event),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<nk_mouse_event>())).middle as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(nk_mouse_event),
            "::",
            stringify!(middle)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<nk_mouse_event>())).right as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(nk_mouse_event),
            "::",
            stringify!(right)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<nk_mouse_event>())).res as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(nk_mouse_event),
            "::",
            stringify!(res)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<nk_mouse_event>())).dx as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nk_mouse_event),
            "::",
            stringify!(dx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<nk_mouse_event>())).dy as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nk_mouse_event),
            "::",
            stringify!(dy)
        )
    );
}
pub type nk_mouse_event_t = nk_mouse_event;
extern "C" {
    pub fn ps2_init(naut: *mut naut_info) -> core::ffi::c_int;
}
extern "C" {
    pub fn ps2_reset() -> core::ffi::c_int;
}
extern "C" {
    pub fn ps2_kbd_reset() -> core::ffi::c_int;
}
extern "C" {
    pub fn ps2_mouse_reset() -> core::ffi::c_int;
}
extern "C" {
    pub fn ps2_deinit() -> core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nk_thread {
    _unused: [u8; 0],
}
pub const nk_vc_type_RAW: nk_vc_type = 0;
pub const nk_vc_type_COOKED: nk_vc_type = 1;
pub const nk_vc_type_RAW_NOQUEUE: nk_vc_type = 2;
pub type nk_vc_type = core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nk_virtual_console {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nk_vc_ops {
    pub raw_noqueue: ::core::option::Option<
        unsafe extern "C" fn(arg1: nk_scancode_t, priv_: *mut core::ffi::c_void),
    >,
}
#[test]
fn bindgen_test_layout_nk_vc_ops() {
    assert_eq!(
        ::core::mem::size_of::<nk_vc_ops>(),
        8usize,
        concat!("Size of: ", stringify!(nk_vc_ops))
    );
    assert_eq!(
        ::core::mem::align_of::<nk_vc_ops>(),
        8usize,
        concat!("Alignment of ", stringify!(nk_vc_ops))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<nk_vc_ops>())).raw_noqueue as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nk_vc_ops),
            "::",
            stringify!(raw_noqueue)
        )
    );
}
extern "C" {
    pub fn nk_create_vc(
        name: *mut core::ffi::c_char,
        new_vc_type: nk_vc_type,
        attr: u8,
        ops: *mut nk_vc_ops,
        priv_: *mut core::ffi::c_void,
    ) -> *mut nk_virtual_console;
}
extern "C" {
    pub fn nk_destroy_vc(vc: *mut nk_virtual_console) -> core::ffi::c_int;
}
extern "C" {
    pub fn nk_bind_vc(thread: *mut nk_thread, cons: *mut nk_virtual_console) -> core::ffi::c_int;
}
extern "C" {
    pub fn nk_release_vc(thread: *mut nk_thread) -> core::ffi::c_int;
}
extern "C" {
    pub fn nk_get_cur_vc() -> *mut nk_virtual_console;
}
extern "C" {
    pub fn nk_switch_to_vc(vc: *mut nk_virtual_console) -> core::ffi::c_int;
}
extern "C" {
    pub fn nk_switch_to_prev_vc() -> core::ffi::c_int;
}
extern "C" {
    pub fn nk_switch_to_next_vc() -> core::ffi::c_int;
}
extern "C" {
